Revit 2024 API
BuiltInFailures.StairRampFailures.StairsWinderInvalidParamsFailure Property
 Cannot create the winder run because some values for the instance properties cannot be satisfied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsWinderInvalidParamsFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsWinderInvalidParamsFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsWinderInvalidParamsFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace